content/presentaciones/Logica7068/laboratorio.org
#+title: Laboratorio
#+author: Erik Rangel Limón
#+startup: latexpreview


* Haskell

  Es el lenguaje de programación que utilizaremos para realizar
  la mayor parte de las prácticas de laboratorio.

  Se propone éste lenguaje pues cuenta con transparencia referencial,
  lo que garantiza que se pueda reemplazar una expresión con otra de
  igual valor sin cambiar el significado de éste. Como consecuencia,
  una función siempre producirá el mismo resultado para una entrada
  dada, por lo que es posible construir, razonar y manipular programas
  funcionales como si se tratasen de una expresión matemática.

** Instalación

   /Haskell/ es un lenguaje compilado, pero también puede comportarse
   como un programa interpretado. Ambas herramientas vienen al
   instalar /GHC/ (/Glasgow Haskell Compiler/), el cuál es el compilador
   más usado hoy en día para /Haskell/.

   /Haskell/ también cuenta con un administrador de paquetes /Cabal/,
   mediante el cual puedes instalar nuevas bibliotecas y programas. En
   particular la utilizaremos más adelante para instalar /QuickCheck/.

   Tanto /Haskell/ y /Cabal/ pueden ser instaladas con =ghcup=, que es un
   instalador para éstos y más programas en torno a /Haskell/, y para
   cualquier sistema basado en /Unix/, y los sistemas operativos /Windows/
   y /MacOS/.

   Las instrucciones específicas de cada sistema vienen en la
   siguiente página:

   https://www.haskell.org/ghcup/install/#installation

   
*** Requerimientos

    - Debian >= 12:

      #+begin_src shell
build-essential curl libffi-dev libffi8 libgmp-dev libgmp10 libncurses-dev libncurses5 libtinfo5
      #+end_src

    - Ubuntu >= 23:

      #+begin_src shell
build-essential curl libffi-dev libffi8ubuntu1 libgmp-dev libgmp10 libncurses-dev
      #+end_src

    - Fedora:

      #+begin_src shell
gcc gcc-c++ gmp gmp-devel make ncurses ncurses-compat-libs xz perl
      #+end_src

    - Linux:

      Investiguen según su distribución cómo instalar los siguientes paquetes:
    
      #+begin_src shell
curl g++ gcc gmp make ncurses realpath xz-utils
      #+end_src

    - Mac M1:

      En los sistemas operativos /OS X/ los programas requeridos se
      configuran al instalar =ghcup=, posiblemente tengan que ejecutar
      el comando otra vez.

      En computadoras con /M1/, deben investiguen cómo instalar =llvm= con
      =hombrew= y cómo exponerlo en el =PATH=.

*** GHCup

    El comando que debe utilizarse para instalarlo en /Linux/, /macOS/,
    /FreeBSD/ o /WSL2/ es el siguiente:

    #+begin_src shell
curl --proto '=https' --tlsv1.2 -sSf https://get-ghcup.haskell.org | sh
    #+end_src

    (al 29 de enero de 2024, revisen la página si es que ésto cambia).

    Al terminar la instalación reinicien su =shell= y el comando =ghcup
    tui= les abrirá una interfaz de terminal por la cual podrán navegar
    por las distintas versiones de /GHC/ y /Cabal/, sólo asegúrense de
    usar las versiones de ambas herramientas respectivamente.

*** Administrador de paquetes

    Además de instalar los requerimientos mencionados anteriormente,
    los programas que necesitan por lo general llevan los nombres de
    =ghc= y =cabal-install=.

    
** Introducción

   La extensión comúnmente usada para los archivos es =.hs=
   
*** Variables y tipos primitivos

    | Tipo          | Ejemplo              |
    |---------------+----------------------|
    | Int           | ...,-2,-1,0,1,2,...  |
    | Float, Double | 1.0,-1.25,2.5,...    |
    | Bool          | True, False          |
    | Char          | 'a','b','c','\n',... |
    | Integer       | ...,-1,0,1,2,3,...   |

    La creación de variables se puede hacer de la siguiente forma:

    #+begin_src haskell
x :: Int
x = 5

x' :: Float
x' = 10.42
  
y :: Double
y = 10.4283762683

z :: Bool
z = False

c :: Char
c = 'a'
    #+end_src

    
**** Inmutabilidad

     En /Haskell/ todas las variables son inmutables, es decir, una vez
     que se definen, ya no pueden cambiar su valor.

     Por ejemplo, el siguiente código nos arrojará un error:
    
     #+begin_src haskell
num :: Int
num = 1

num :: Int
num = 2
     #+end_src

