presentaciones/Logica7068/laboratorio.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-13 Tue 14:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Laboratorio</title>
<meta name="author" content="Erik Rangel Limón" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Laboratorio</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgac8343f">Haskell</a>
<ul>
<li><a href="#org9ce3259">Instalación</a>
<ul>
<li><a href="#org7927872">Requerimientos</a></li>
<li><a href="#orge4074e2">GHCup</a></li>
<li><a href="#orgee49b98">Administrador de paquetes</a></li>
</ul>
</li>
<li><a href="#orga9ff121">Introducción</a>
<ul>
<li><a href="#orgfebe639">Variables y tipos primitivos</a></li>
<li><a href="#org74c55c7">Funciones</a></li>
<li><a href="#org07875e7">Operadores</a></li>
<li><a href="#org0b34376">Precedencia</a></li>
<li><a href="#org5ff19bf">Funciones anónimas</a></li>
</ul>
</li>
<li><a href="#orgf09cfa9">Listas, definiciones de tipos de dato y coincidencia de patrones</a>
<ul>
<li><a href="#orgd015a4f">Condicionales</a></li>
<li><a href="#org8ab349c">Coincidencia de patrones</a></li>
<li><a href="#orgb1443e3">Funciones de orden superior</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge3eb640">Lógica proposicional en Haskell</a></li>
<li><a href="#org8b3c920">Prolog</a>
<ul>
<li><a href="#orge4d5615">Predicados y constantes</a></li>
<li><a href="#org849a722">Consultas</a></li>
<li><a href="#org5660c27">Condiciones y Variables</a></li>
<li><a href="#orgd95c9c6">Backtracking</a></li>
<li><a href="#orgf716277">Números y Operadores</a>
<ul>
<li><a href="#orgbc3920e">Negación como falla</a></li>
<li><a href="#org4e5da61">Unificación</a></li>
</ul>
</li>
<li><a href="#org559a450">Ejemplos</a></li>
<li><a href="#org5f183d2">Listas y comodines</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgac8343f" class="outline-2">
<h2 id="orgac8343f">Haskell</h2>
<div class="outline-text-2" id="text-orgac8343f">
<p>
Es el lenguaje de programación que utilizaremos para realizar
la mayor parte de las prácticas de laboratorio.
</p>

<p>
Se propone éste lenguaje pues cuenta con transparencia referencial,
lo que garantiza que se pueda reemplazar una expresión con otra de
igual valor sin cambiar el significado de éste. Como consecuencia,
una función siempre producirá el mismo resultado para una entrada
dada, por lo que es posible construir, razonar y manipular programas
funcionales como si se tratasen de una expresión matemática.
</p>
</div>

<div id="outline-container-org9ce3259" class="outline-3">
<h3 id="org9ce3259">Instalación</h3>
<div class="outline-text-3" id="text-org9ce3259">
<p>
<i>Haskell</i> es un lenguaje compilado, pero también puede comportarse
como un programa interpretado. Ambas herramientas vienen al
instalar <i>GHC</i> (<i>Glasgow Haskell Compiler</i>), el cuál es el compilador
más usado hoy en día para <i>Haskell</i>.
</p>

<p>
<i>Haskell</i> también cuenta con un administrador de paquetes <i>Cabal</i>,
mediante el cual puedes instalar nuevas bibliotecas y programas. En
particular la utilizaremos más adelante para instalar <i>QuickCheck</i>.
</p>

<p>
Tanto <i>Haskell</i> y <i>Cabal</i> pueden ser instaladas con <code>ghcup</code>, que es un
instalador para éstos y más programas en torno a <i>Haskell</i>, y para
cualquier sistema basado en <i>Unix</i>, y los sistemas operativos <i>Windows</i>
y <i>MacOS</i>.
</p>

<p>
Las instrucciones específicas de cada sistema vienen en la
siguiente página:
</p>

<p>
<a href="https://www.haskell.org/ghcup/install/#installation">https://www.haskell.org/ghcup/install/#installation</a>
</p>
</div>


<div id="outline-container-org7927872" class="outline-4">
<h4 id="org7927872">Requerimientos</h4>
<div class="outline-text-4" id="text-org7927872">
<ul class="org-ul">
<li><p>
Debian &gt;= 12:
</p>

<div class="org-src-container">
<pre class="src src-shell">build-essential curl libffi-dev libffi8 libgmp-dev libgmp10 libncurses-dev libncurses5 libtinfo5
</pre>
</div></li>

<li><p>
Ubuntu &gt;= 23:
</p>

<div class="org-src-container">
<pre class="src src-shell">build-essential curl libffi-dev libffi8ubuntu1 libgmp-dev libgmp10 libncurses-dev
</pre>
</div></li>

<li><p>
Fedora:
</p>

<div class="org-src-container">
<pre class="src src-shell">gcc gcc-c++ gmp gmp-devel make ncurses ncurses-compat-libs xz perl
</pre>
</div></li>

<li><p>
Linux:
</p>

<p>
Investiguen según su distribución cómo instalar los siguientes paquetes:
</p>

<div class="org-src-container">
<pre class="src src-shell">curl g++ gcc gmp make ncurses realpath xz-utils
</pre>
</div></li>

<li><p>
Mac M1:
</p>

<p>
En los sistemas operativos <i>OS X</i> los programas requeridos se
configuran al instalar <code>ghcup</code>, posiblemente tengan que ejecutar
el comando otra vez.
</p>

<p>
En computadoras con <i>M1</i>, deben investiguen cómo instalar <code>llvm</code> con
<code>hombrew</code> y cómo exponerlo en el <code>PATH</code>.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orge4074e2" class="outline-4">
<h4 id="orge4074e2">GHCup</h4>
<div class="outline-text-4" id="text-orge4074e2">
<p>
El comando que debe utilizarse para instalarlo en <i>Linux</i>, <i>macOS</i>,
<i>FreeBSD</i> o <i>WSL2</i> es el siguiente:
</p>

<div class="org-src-container">
<pre class="src src-shell">curl --proto <span style="font-style: italic;">'=https'</span> --tlsv1.2 -sSf https://get-ghcup.haskell.org | sh
</pre>
</div>

<p>
(al 29 de enero de 2024, revisen la página si es que ésto cambia).
</p>

<p>
Al terminar la instalación reinicien su <code>shell</code> y el comando <code>ghcup
    tui</code> les abrirá una interfaz de terminal por la cual podrán navegar
por las distintas versiones de <i>GHC</i> y <i>Cabal</i>, sólo asegúrense de
usar las versiones de ambas herramientas respectivamente.
</p>
</div>
</div>

<div id="outline-container-orgee49b98" class="outline-4">
<h4 id="orgee49b98">Administrador de paquetes</h4>
<div class="outline-text-4" id="text-orgee49b98">
<p>
Además de instalar los requerimientos mencionados anteriormente,
los programas que necesitan por lo general llevan los nombres de
<code>ghc</code> y <code>cabal-install</code>.
</p>
</div>
</div>
</div>


<div id="outline-container-orga9ff121" class="outline-3">
<h3 id="orga9ff121">Introducción</h3>
<div class="outline-text-3" id="text-orga9ff121">
<p>
La extensión comúnmente usada para los archivos es <code>.hs</code>
</p>
</div>

<div id="outline-container-orgfebe639" class="outline-4">
<h4 id="orgfebe639">Variables y tipos primitivos</h4>
<div class="outline-text-4" id="text-orgfebe639">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipo</th>
<th scope="col" class="org-left">Ejemplo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Int</td>
<td class="org-left">&#x2026;,-2,-1,0,1,2,&#x2026;</td>
</tr>

<tr>
<td class="org-left">Float, Double</td>
<td class="org-left">1.0,-1.25,2.5,&#x2026;</td>
</tr>

<tr>
<td class="org-left">Bool</td>
<td class="org-left">True, False</td>
</tr>

<tr>
<td class="org-left">Char</td>
<td class="org-left">'a','b','c','\n',&#x2026;</td>
</tr>

<tr>
<td class="org-left">Integer</td>
<td class="org-left">&#x2026;,-1,0,1,2,3,&#x2026;</td>
</tr>
</tbody>
</table>

<p>
La creación de variables se puede hacer de la siguiente forma:
</p>

<div class="org-src-container">
<pre class="src src-haskell">x :: Int
x = 5

x' :: Float
x' = 10.42

y :: Double
y = 10.4283762683

z :: Bool
z = False

c :: Char
c = 'a'
</pre>
</div>
</div>


<ul class="org-ul">
<li><a id="org3fa4a51"></a>Inmutabilidad<br />
<div class="outline-text-5" id="text-org3fa4a51">
<p>
En <i>Haskell</i> todas las variables son inmutables, es decir, una vez
que se definen, ya no pueden cambiar su valor.
</p>

<p>
Por ejemplo, el siguiente código nos arrojará un error:
</p>

<div class="org-src-container">
<pre class="src src-haskell">num :: Int
num = 1

num :: Int
num = 2
</pre>
</div>
</div>
</li>
</ul>
</div>
