content/presentaciones/Logica7068/laboratorio.org
*** Funciones

    Las funciones en /Haskell/ juegan un papel esencial (claro, por eso
    es un lenguaje de programación funcional).

    En matemáticas, una función es una relación de elementos de un
    conjunto $A$ a elementos de un conjunto $B$, donde un elemento de
    $A$ se "mapea" con un único elemento del conjunto $B$.

    Considera una función que eleva al cuadrado un número entero, su
    dominio y codominio se denotaría como sigue:

    $f:\mathbb{Z}\to\mathbb{Z}$

    Se define la función:
    
    $f(x)=x^2$

    Y para evaluar la función, sustituyes los parámetros de la función
    por un valor:

    $f(2)=2^2=4$

    $f(3)=3^2=9$

    Análogamente, el tipo de esta función se denotaría como:

    #+begin_src haskell
f :: Int -> Int
f x = x ^ 2
    #+end_src

    Y para evaluar una función:

    #+begin_src haskell
resultado1 :: Int
resultado1 = f 2

resultado2 :: Int
resultado2 = f 3
    #+end_src

    Para abrir el intérprete de /Haskell/, lo puédes abrir con
    =ghci=. Para cargar un archivo dentro del intérprete, lo puedes
    hacer con el comando =:t ruta/del/archivo.hs=

    Y puedes evaluar las funciones o variables que definiste.

    #+begin_src haskell
ghci> f 12
144
ghci> f 9
81
ghci> resultado1
4
ghci> resultado2
9
    #+end_src

    Sin embargo, cabe mencionar que la lógica para funciones
    multivariadas cambia, al menos con los tipos.

    Si ahora queremos hacer una función que recibe dos enteros y
    devuelve otro entero (la suma de ambos), lo haríamos de la
    siguiente forma:

    #+begin_src haskell
suma :: Int -> Int -> Int
suma x y = x + y
    #+end_src

    Y para una función de 3 parámetros:

    #+begin_src haskell
suma3 :: Int -> Int -> Int -> Int
suma3 x y z = x + y + z
    #+end_src

*** Operadores

    Aritméticas:

    - Suma: =+=
    - Resta: =-=
    - Multiplicación: =*=
    - División (Real): =/=
    - División (Entera): =div=
    - Potencia: =^=


    Booleanas:

    - Negación: =not=
    - Conjunción: =&&=
    - Disyunción: =||=


    Comparación:

    - Igualdad: ====
    - Desigualdad: =/==
    - Menor que: =<=
    - Mayor que: =>=
    - Menor igual: =<==
    - Mayor igual: =>==
    
*** Precedencia

    Consideremos la función que dados dos números, suma los cuadrados
    de ambos

    #+begin_src haskell
sumaCuadrados :: Int -> Int -> Int
sumaCuadrados x y = x^2 + y^2
    #+end_src

    esta es una definición de función, cabe recordar que los nombres
    de funciones y variables deben siempre iniciar con una letra
    minúscula seguido de una serie de caracteres alfanuméricos.

    Las funciones definidas de esta manera como ya vimos, las podemos
    utilizar de la siguiente forma:

    #+begin_src haskell
ghci> suma_cuadrados 2 3
13
    #+end_src

    Sin embargo, también es posible aplicar la función de manera
    infija, escribiendo el nombre de la función entre dos acentos
    graves =`=:

    #+begin_src haskell
ghci> 2 `suma_cuadrados` 3
13
ghci> 5 `div` 2
2
    #+end_src

    Pero haskell también nos deja crear nuestros propios operadores, y
    su nombre puede ser cualquier combinación de los siguientes
    símbolos:

    =! # $ * + . / < = > ? \ ^ | : - ~ %=

    Para denotar su tipo lo hacemos entre paréntesis:

    #+begin_src haskell
(<+<) :: Int -> Int -> Int
x <+< y = x^2 + y^2
    #+end_src

    También es válido dar la definición de manera prefija escribiendo
    el operador entre paréntesis.

    #+begin_src haskell
(<+<) :: Int -> Int -> Int
(<+<) x y = x^2 + y^2
    #+end_src

    Y ya lo podemos utilizar como cualquier otro operador

    #+begin_src haskell
ghci> 2 <+< 3
13
    #+end_src

    De la misma manera es posible utilizar cualquier operador de
    manera prefija escribiendo el nombre del operador entre
    paréntesis:

    #+begin_src haskell
ghci> (<+<) 2 3
13
ghci> (+) 2 3
5
ghci> (-) 5 2
3
    #+end_src

    Al utilizar notación infija estamos eliminando el uso de
    paréntesis

    #+begin_src haskell
(<+<) ((<+<) 2 3) 4
    #+end_src

    #+begin_src haskell
(2 <+< 3) <+< 4
2 <+< 3 <+< 4 -- Por defecto los operadores asocian a la izquierda
    #+end_src

    #+begin_src haskell
  5/2+3*2/3*(231)
    #+end_src

    Sin embargo al combinarlo con otros operadores, posiblemente
    queramos que asocie de una forma distinta, y esto lo podemos hacer
    con las palabras reservadas =infixl= e =infixr=, por ejemplo, la
    asociatividas y precedencia de las operaciones aritméticas básicas
    se muestra como sigue:

    #+begin_src haskell
infixl 6 +, -
infixl 7 *, /
    #+end_src

    Y si quisiéramos que el operador =<+<= tuviera la misma precedencia
    que la multiplicación y la división, lo tendríamos que definir
    como sigue:

    #+begin_src haskell
infixl 7 <+<
    #+end_src

    #+begin_src haskell
ghci> 5 * 2 <+< 3 - 1
108
    #+end_src

*** Funciones anónimas

    ¿Y si necesitamos hacer una función auxiliar que nada más usaré
    una vez, vale la pena definirla si quiera?

    #+begin_src haskell
ghci> (\x -> x + 1) 4
5
ghci> (\x y -> x + y) 5 4
9
ghci> (\x y z -> x * y - z) 5 4 3
17
    #+end_src

