presentaciones/Logica7068/laboratorio.html

<div id="outline-container-org74c55c7" class="outline-4">
<h4 id="org74c55c7">Funciones</h4>
<div class="outline-text-4" id="text-org74c55c7">
<p>
Las funciones en <i>Haskell</i> juegan un papel esencial (claro, por eso
es un lenguaje de programación funcional).
</p>

<p>
En matemáticas, una función es una relación de elementos de un
conjunto \(A\) a elementos de un conjunto \(B\), donde un elemento de
\(A\) se "mapea" con un único elemento del conjunto \(B\).
</p>

<p>
Considera una función que eleva al cuadrado un número entero, su
dominio y codominio se denotaría como sigue:
</p>

<p>
\(f:\mathbb{Z}\to\mathbb{Z}\)
</p>

<p>
Se define la función:
</p>

<p>
\(f(x)=x^2\)
</p>

<p>
Y para evaluar la función, sustituyes los parámetros de la función
por un valor:
</p>

<p>
\(f(2)=2^2=4\)
</p>

<p>
\(f(3)=3^2=9\)
</p>

<p>
Análogamente, el tipo de esta función se denotaría como:
</p>

<div class="org-src-container">
<pre class="src src-haskell">f :: Int -&gt; Int
f x = x ^ 2
</pre>
</div>

<p>
Y para evaluar una función:
</p>

<div class="org-src-container">
<pre class="src src-haskell">resultado1 :: Int
resultado1 = f 2

resultado2 :: Int
resultado2 = f 3
</pre>
</div>

<p>
Para abrir el intérprete de <i>Haskell</i>, lo puédes abrir con
<code>ghci</code>. Para cargar un archivo dentro del intérprete, lo puedes
hacer con el comando <code>:t ruta/del/archivo.hs</code>
</p>

<p>
Y puedes evaluar las funciones o variables que definiste.
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; f 12
144
ghci&gt; f 9
81
ghci&gt; resultado1
4
ghci&gt; resultado2
9
</pre>
</div>

<p>
Sin embargo, cabe mencionar que la lógica para funciones
multivariadas cambia, al menos con los tipos.
</p>

<p>
Si ahora queremos hacer una función que recibe dos enteros y
devuelve otro entero (la suma de ambos), lo haríamos de la
siguiente forma:
</p>

<div class="org-src-container">
<pre class="src src-haskell">suma :: Int -&gt; Int -&gt; Int
suma x y = x + y
</pre>
</div>

<p>
Y para una función de 3 parámetros:
</p>

<div class="org-src-container">
<pre class="src src-haskell">suma3 :: Int -&gt; Int -&gt; Int -&gt; Int
suma3 x y z = x + y + z
</pre>
</div>
</div>
</div>

<div id="outline-container-org07875e7" class="outline-4">
<h4 id="org07875e7">Operadores</h4>
<div class="outline-text-4" id="text-org07875e7">
<p>
Aritméticas:
</p>

<ul class="org-ul">
<li>Suma: <code>+</code></li>
<li>Resta: <code>-</code></li>
<li>Multiplicación: <code>*</code></li>
<li>División (Real): <code>/</code></li>
<li>División (Entera): <code>div</code></li>
<li>Potencia: <code>^</code></li>
</ul>


<p>
Booleanas:
</p>

<ul class="org-ul">
<li>Negación: <code>not</code></li>
<li>Conjunción: <code>&amp;&amp;</code></li>
<li>Disyunción: <code>||</code></li>
</ul>


<p>
Comparación:
</p>

<ul class="org-ul">
<li>Igualdad: <code>==</code></li>
<li>Desigualdad: <code>/=</code></li>
<li>Menor que: <code>&lt;</code></li>
<li>Mayor que: <code>&gt;</code></li>
<li>Menor igual: <code>&lt;=</code></li>
<li>Mayor igual: <code>&gt;=</code></li>
</ul>
</div>
</div>

<div id="outline-container-org0b34376" class="outline-4">
<h4 id="org0b34376">Precedencia</h4>
<div class="outline-text-4" id="text-org0b34376">
<p>
Consideremos la función que dados dos números, suma los cuadrados
de ambos
</p>

<div class="org-src-container">
<pre class="src src-haskell">sumaCuadrados :: Int -&gt; Int -&gt; Int
sumaCuadrados x y = x^2 + y^2
</pre>
</div>

<p>
esta es una definición de función, cabe recordar que los nombres
de funciones y variables deben siempre iniciar con una letra
minúscula seguido de una serie de caracteres alfanuméricos.
</p>

<p>
Las funciones definidas de esta manera como ya vimos, las podemos
utilizar de la siguiente forma:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; suma_cuadrados 2 3
13
</pre>
</div>

<p>
Sin embargo, también es posible aplicar la función de manera
infija, escribiendo el nombre de la función entre dos acentos
graves <code>`</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; 2 `suma_cuadrados` 3
13
ghci&gt; 5 `div` 2
2
</pre>
</div>

<p>
Pero haskell también nos deja crear nuestros propios operadores, y
su nombre puede ser cualquier combinación de los siguientes
símbolos:
</p>

<p>
<code>! # $ * + . / &lt; = &gt; ? \ ^ | : - ~ %</code>
</p>

<p>
Para denotar su tipo lo hacemos entre paréntesis:
</p>

<div class="org-src-container">
<pre class="src src-haskell">(&lt;+&lt;) :: Int -&gt; Int -&gt; Int
x &lt;+&lt; y = x^2 + y^2
</pre>
</div>

<p>
También es válido dar la definición de manera prefija escribiendo
el operador entre paréntesis.
</p>

<div class="org-src-container">
<pre class="src src-haskell">(&lt;+&lt;) :: Int -&gt; Int -&gt; Int
(&lt;+&lt;) x y = x^2 + y^2
</pre>
</div>

<p>
Y ya lo podemos utilizar como cualquier otro operador
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; 2 &lt;+&lt; 3
13
</pre>
</div>

<p>
De la misma manera es posible utilizar cualquier operador de
manera prefija escribiendo el nombre del operador entre
paréntesis:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; (&lt;+&lt;) 2 3
13
ghci&gt; (+) 2 3
5
ghci&gt; (-) 5 2
3
</pre>
</div>

<p>
Al utilizar notación infija estamos eliminando el uso de
paréntesis
</p>

<div class="org-src-container">
<pre class="src src-haskell">(&lt;+&lt;) ((&lt;+&lt;) 2 3) 4
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">(2 &lt;+&lt; 3) &lt;+&lt; 4
2 &lt;+&lt; 3 &lt;+&lt; 4 -- Por defecto los operadores asocian a la izquierda
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">5/2+3*2/3*(231)
</pre>
</div>

<p>
Sin embargo al combinarlo con otros operadores, posiblemente
queramos que asocie de una forma distinta, y esto lo podemos hacer
con las palabras reservadas <code>infixl</code> e <code>infixr</code>, por ejemplo, la
asociatividas y precedencia de las operaciones aritméticas básicas
se muestra como sigue:
</p>

<div class="org-src-container">
<pre class="src src-haskell">infixl 6 +, -
infixl 7 *, /
</pre>
</div>

<p>
Y si quisiéramos que el operador <code>&lt;+&lt;</code> tuviera la misma precedencia
que la multiplicación y la división, lo tendríamos que definir
como sigue:
</p>

<div class="org-src-container">
<pre class="src src-haskell">infixl 7 &lt;+&lt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; 5 * 2 &lt;+&lt; 3 - 1
108
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ff19bf" class="outline-4">
<h4 id="org5ff19bf">Funciones anónimas</h4>
<div class="outline-text-4" id="text-org5ff19bf">
<p>
¿Y si necesitamos hacer una función auxiliar que nada más usaré
una vez, vale la pena definirla si quiera?
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; (\x -&gt; x + 1) 4
5
ghci&gt; (\x y -&gt; x + y) 5 4
9
ghci&gt; (\x y z -&gt; x * y - z) 5 4 3
17
</pre>
</div>
</div>
</div>
</div>
