content/presentaciones/Logica7068/laboratorio.org
** Listas, definiciones de tipos de dato y coincidencia de patrones

    ¿Recuerdan la definición inductiva de listas?

    Listas con elementos de un tipo $A$:

    - La lista vacía $[]$, es una lista con elementos de tipo $A$.
      
    - Si $x$ (cabeza) es un elemento de tipo $A$ y $xs$ una lista con
      elementos de tipo $A$, entonces $x:xs$ es una lista de elementos
      de tipo $A$.

    - Son todas.


    En /Haskell/ también existen las listas bajo la misma semántica de
    la definición inductiva.

    Primero, podemos definir nuestros propios tipos de dato:

    #+begin_src haskell
data Color = Rojo | Verde | Azul
    #+end_src

    =Rojo=, =Verde= y =Azul= son constructores

    Funcionan similar a una enumeración en java.

    #+begin_src haskell
favorito :: Color
favorito = Verde
    #+end_src

    Estas definiciones de tipos de dato pueden contener otros tipos,
    por ejemplo:

    #+begin_src haskell
data Figura = Cuadrado Double
            | Rectangulo Double Double
            | Circulo Double
    #+end_src

    =Cuadrado=, =Rectangulo= y =Circulo= son los constructores

    #+begin_src haskell
cuadrado :: Figura
cuadrado = Cuadrado 4.2

rectangulo :: Figura
rectangulo = Rectangulo 1.2 5.5

circulo :: Figura
circulo = Circulo 2.3
    #+end_src

    ¿Que pasa si un constructor tiene muchos tipos?
    
    #+begin_src haskell
data Alumno = Alumno String String Double Int
    #+end_src

    Podemos usar la sintaxis /record/:

    #+begin_src haskell
data Alumno = Alumno { nombre :: String
                     , noCuenta :: String
                     , calif :: Double
                     , asistencias :: Int}
    #+end_src

    #+begin_src haskell
limon :: Alumno
limon = Alumno { noCuenta = "123456789"
              , calif = 4.8
              , nombre = "Erik Rangel Limón"
              , asistencias = 2 }
    #+end_src
    
    #+begin_src haskell
ghci> noCuenta erik
"123456789"
    #+end_src

    Las definiciones de tipos de dato también pueden utilizar
    variables de tipo:

    #+begin_src haskell
data Talvez a = Nada | Solo a
    #+end_src

    Los tipos de dato también pueden ser definiciones inductivas; por
    ejemplo, los números naturales

    #+begin_src haskell
data Nat = Zero
         | Suc Nat
    #+end_src

    #+begin_src haskell
cero :: Nat
cero = Zero

tres :: Nat
tres = Suc (Suc (Suc Zero))

cuatro :: Nat
cuatro = Suc tres
    #+end_src

    Ahora, por fin, con las listas, ¿cómo seguimos con la definición?

    #+begin_src haskell
  data Lista a = Vacia -- La lista vacia es una lista de elementos de
                       -- tipo a
               | Cons a (Lista a) -- Un elemento concatenado con otra
                                  -- lista de elementos de tipo a es
                                  -- una lista con elementos de tipo a
    #+end_src

    Afortunadamente /haskell/ ya define este tipo de listas.

    #+begin_src haskell
data [] a = [] | a : ([] a)
    #+end_src

    Por ejemplo, una lista con número enteros

    #+begin_src haskell
enteros :: [] Int
enteros = 1 : 2 : 3 : 4 : 5 : []
    #+end_src

    Pero /haskell/ ofrece una sintaxis más corta para representar listas
    (y el tipo de una lista):

    #+begin_src haskell
enteros2 :: [Double]
enteros2 = [1.24,5.2,7.5,9.3]
    #+end_src

**** Tipos sinónimo

     Nosotros podemos hacer sinónimos de tipos de dato:

     #+begin_src haskell
type Calificacion = Double
type Clase = [Alumnos]
type Paleta = [Color]
     #+end_src

     #+begin_src haskell
alumnos1 :: Clase
alumnos1 = [erik, juan, alberto]
     #+end_src
**** Strings

     Sí, sí existen cadenas en haskell, pero éstas se definen como un
     sinónimo de tipo:

     #+begin_src haskell
type String = [Char]
     #+end_src

     Y para escribir cadenas de texto, haskell nos da la posibilidad
     de usar =""= para representarlas.

     *No olviden que las comillas simples =''= denotan caracteres*
     
*** Condicionales

    Como en cualquier lenguaje de programación, tenemos expresiones
    condicionales para manejar casos en los que se cumpla una
    propiedad:

    La sintaxis que tiene es la siguiente:

    =if <expresión booleana> then <expr de tipo A> else <expr de tipo A>=

    #+begin_src haskell
ghci> if 4 < 5 then "Primer caso" else "Segundo caso"
"Primer caso"  
    #+end_src

    #+begin_src haskell
ghci> if 4 < 3 then "Primer caso" else "Segundo caso"
"Segundo caso"
    #+end_src

    Es importante que los resultados tanto del =then= como del =else= sean
    del mismo tipo, si no, nos va a dar error:

    #+begin_src haskell
ghci> if 3 < 4 then "Primer caso" else 2.5
    #+end_src

    #+begin_src haskell
mimax :: Int -> Int -> Int
mimax n m = if n > m then n else m
    #+end_src

    La otra opción que tenemos para manejar casos es con guardias, y
    éstas son exclusivas cuando se definen funciones.

    #+begin_src haskell
compara :: Int -> Int -> String
compara n m | n < m = "El primero es menor que el segundo"
            | n == m = "Son iguales"
            | otherwise = "El primero es mayor que el segundo"
    #+end_src

    Estas suelen reducir la sintaxis cuando son más las condiciones
    que se deben revisar, sin embargo, debes cerciorarte de ser
    completo con tus condiciones, es decir, que al menos una condición
    se cumpla.

    Para asegurar esto siempre es recomendable usar poner un caso para
    cuando ninguna de las anteriores se haya cumplido.

    #+begin_src haskell
compara2 :: Int -> Int -> String
compara2 n m | n < m = "El primero es menor que el segundo"
             | n == m = "Son iguales"
             | otherwise = "El primero es mayor que el segundo"
    #+end_src

