presentaciones/Logica7068/laboratorio.html

<div id="outline-container-orgf09cfa9" class="outline-3">
<h3 id="orgf09cfa9">Listas, definiciones de tipos de dato y coincidencia de patrones</h3>
<div class="outline-text-3" id="text-orgf09cfa9">
<p>
¿Recuerdan la definición inductiva de listas?
</p>

<p>
Listas con elementos de un tipo \(A\):
</p>

<ul class="org-ul">
<li>La lista vacía \([]\), es una lista con elementos de tipo \(A\).</li>

<li>Si \(x\) (cabeza) es un elemento de tipo \(A\) y \(xs\) una lista con
elementos de tipo \(A\), entonces \(x:xs\) es una lista de elementos
de tipo \(A\).</li>

<li>Son todas.</li>
</ul>


<p>
En <i>Haskell</i> también existen las listas bajo la misma semántica de
la definición inductiva.
</p>

<p>
Primero, podemos definir nuestros propios tipos de dato:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Color = Rojo | Verde | Azul
</pre>
</div>

<p>
<code>Rojo</code>, <code>Verde</code> y <code>Azul</code> son constructores
</p>

<p>
Funcionan similar a una enumeración en java.
</p>

<div class="org-src-container">
<pre class="src src-haskell">favorito :: Color
favorito = Verde
</pre>
</div>

<p>
Estas definiciones de tipos de dato pueden contener otros tipos,
por ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Figura = Cuadrado Double
            | Rectangulo Double Double
            | Circulo Double
</pre>
</div>

<p>
<code>Cuadrado</code>, <code>Rectangulo</code> y <code>Circulo</code> son los constructores
</p>

<div class="org-src-container">
<pre class="src src-haskell">cuadrado :: Figura
cuadrado = Cuadrado 4.2

rectangulo :: Figura
rectangulo = Rectangulo 1.2 5.5

circulo :: Figura
circulo = Circulo 2.3
</pre>
</div>

<p>
¿Que pasa si un constructor tiene muchos tipos?
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Alumno = Alumno String String Double Int
</pre>
</div>

<p>
Podemos usar la sintaxis <i>record</i>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Alumno = Alumno { nombre :: String
                     , noCuenta :: String
                     , calif :: Double
                     , asistencias :: Int}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">limon :: Alumno
limon = Alumno { noCuenta = "123456789"
              , calif = 4.8
              , nombre = "Erik Rangel Limón"
              , asistencias = 2 }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; noCuenta erik
"123456789"
</pre>
</div>

<p>
Las definiciones de tipos de dato también pueden utilizar
variables de tipo:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Talvez a = Nada | Solo a
</pre>
</div>

<p>
Los tipos de dato también pueden ser definiciones inductivas; por
ejemplo, los números naturales
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Nat = Zero
         | Suc Nat
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">cero :: Nat
cero = Zero

tres :: Nat
tres = Suc (Suc (Suc Zero))

cuatro :: Nat
cuatro = Suc tres
</pre>
</div>

<p>
Ahora, por fin, con las listas, ¿cómo seguimos con la definición?
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Lista a = Vacia -- La lista vacia es una lista de elementos de
                     -- tipo a
             | Cons a (Lista a) -- Un elemento concatenado con otra
                                -- lista de elementos de tipo a es
                                -- una lista con elementos de tipo a
</pre>
</div>

<p>
Afortunadamente <i>haskell</i> ya define este tipo de listas.
</p>

<div class="org-src-container">
<pre class="src src-haskell">data [] a = [] | a : ([] a)
</pre>
</div>

<p>
Por ejemplo, una lista con número enteros
</p>

<div class="org-src-container">
<pre class="src src-haskell">enteros :: [] Int
enteros = 1 : 2 : 3 : 4 : 5 : []
</pre>
</div>

<p>
Pero <i>haskell</i> ofrece una sintaxis más corta para representar listas
(y el tipo de una lista):
</p>

<div class="org-src-container">
<pre class="src src-haskell">enteros2 :: [Double]
enteros2 = [1.24,5.2,7.5,9.3]
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="orgf069633"></a>Tipos sinónimo<br />
<div class="outline-text-5" id="text-orgf069633">
<p>
Nosotros podemos hacer sinónimos de tipos de dato:
</p>

<div class="org-src-container">
<pre class="src src-haskell">type Calificacion = Double
type Clase = [Alumnos]
type Paleta = [Color]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">alumnos1 :: Clase
alumnos1 = [erik, juan, alberto]
</pre>
</div>
</div>
</li>
<li><a id="org0fd0d81"></a>Strings<br />
<div class="outline-text-5" id="text-org0fd0d81">
<p>
Sí, sí existen cadenas en haskell, pero éstas se definen como un
sinónimo de tipo:
</p>

<div class="org-src-container">
<pre class="src src-haskell">type String = [Char]
</pre>
</div>

<p>
Y para escribir cadenas de texto, haskell nos da la posibilidad
de usar <code>""</code> para representarlas.
</p>

<p>
<b>No olviden que las comillas simples <code>''</code> denotan caracteres</b>
</p>
</div>
</li>
</ul>

<div id="outline-container-orgd015a4f" class="outline-4">
<h4 id="orgd015a4f">Condicionales</h4>
<div class="outline-text-4" id="text-orgd015a4f">
<p>
Como en cualquier lenguaje de programación, tenemos expresiones
condicionales para manejar casos en los que se cumpla una
propiedad:
</p>

<p>
La sintaxis que tiene es la siguiente:
</p>

<p>
<code>if &lt;expresión booleana&gt; then &lt;expr de tipo A&gt; else &lt;expr de tipo A&gt;</code>
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; if 4 &lt; 5 then "Primer caso" else "Segundo caso"
"Primer caso"  
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; if 4 &lt; 3 then "Primer caso" else "Segundo caso"
"Segundo caso"
</pre>
</div>

<p>
Es importante que los resultados tanto del <code>then</code> como del <code>else</code> sean
del mismo tipo, si no, nos va a dar error:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; if 3 &lt; 4 then "Primer caso" else 2.5
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">mimax :: Int -&gt; Int -&gt; Int
mimax n m = if n &gt; m then n else m
</pre>
</div>

<p>
La otra opción que tenemos para manejar casos es con guardias, y
éstas son exclusivas cuando se definen funciones.
</p>

<div class="org-src-container">
<pre class="src src-haskell">compara :: Int -&gt; Int -&gt; String
compara n m | n &lt; m = "El primero es menor que el segundo"
            | n == m = "Son iguales"
            | otherwise = "El primero es mayor que el segundo"
</pre>
</div>

<p>
Estas suelen reducir la sintaxis cuando son más las condiciones
que se deben revisar, sin embargo, debes cerciorarte de ser
completo con tus condiciones, es decir, que al menos una condición
se cumpla.
</p>

<p>
Para asegurar esto siempre es recomendable usar poner un caso para
cuando ninguna de las anteriores se haya cumplido.
</p>

<div class="org-src-container">
<pre class="src src-haskell">compara2 :: Int -&gt; Int -&gt; String
compara2 n m | n &lt; m = "El primero es menor que el segundo"
             | n == m = "Son iguales"
             | otherwise = "El primero es mayor que el segundo"
</pre>
</div>
</div>
</div>
