content/presentaciones/Logica7068/laboratorio.org
*** Coincidencia de patrones

    Éste se le conoce en inglés como /pattern matching/ y en español
    muchas veces lo encontrarán como /caza de patrones/.

    ¿Cómo podemos utilizar funciones con éstos tipos de dato?

    #+begin_src haskell
describe :: Color -> String
describe color = case color of
                   Rojo -> "El color es rojo"
                   Verde -> "El color es verde"
                   Azul -> "El color es azul"
    #+end_src

    #+begin_src haskell
describe2 :: Color -> String
describe2 Rojo = "El color es rojo"
describe2 Verde = "El color es verde"
describe2 Azul = "El color es azul"
    #+end_src

    #+begin_src haskell
predecesor :: Nat -> Nat
predecesor Zero = Zero
predecesor (Suc n) = n
    #+end_src

    #+begin_src haskell
ceroUno :: Nat -> Nat
ceroUno Zero = Suc Zero
ceroUno n = n
    #+end_src

    #+begin_src haskell
esZero :: Nat -> Bool
esZero Zero = True
esZero _ = False
    #+end_src

    ¿Ahora, cómo hacemos coincidencia de patrones con listas?

    #+begin_src haskell
alMenosUno :: [a] -> Bool
alMenosUno [] = False
alMenosUno _ = True
    #+end_src

    Si queremos obtener la cabeza de una lista:

    #+begin_src haskell
cabeza :: [a] -> a
cabeza (x:xs) = x
    #+end_src

    Si queremos obtener la cola de una lista:

    #+begin_src haskell
cola :: [a] -> [a]
cola (x:xs) = xs
    #+end_src

    Suma en naturales:

    $+(0,x)=x$

    $+(s(n), m)=s(n+m)$

    #+begin_src haskell
sumaNats :: Nat -> Nat -> Nat
sumaNats Zero m = m
sumaNats (Suc n) m = Suc (sumaNats n m)
    #+end_src

    Niveles en un árbol:

    Consideremos la definición de árboles binarios que viene en su
    primera práctica:

    #+begin_src haskell
data Bin a = Vacio
           | Nodo a (Bin a) (Bin a) deriving Show
    #+end_src

    Ahora queremos una función que nos regrese el número de hojas que hay en un árbol.

    Una hoja es un árbol cuyos hijos izquierdo y derecho son vacíos.

    #+begin_src haskell
hojas :: Bin a -> Int
hojas Vacio = 0
hojas (Nodo a Vacio Vacio) = 1
hojas (Nodo a l r) = hojas l + hojas r
    #+end_src

    El nivel de un árbol:

    #+begin_src haskell
nivel :: Bin a -> Int
nivel Vacio = -1
nivel (Nodo a l r) = 1 + max (nivel l) (nivel r)
    #+end_src

*** Funciones de orden superior

    Una función de orden superior, es una función que puede recibir
    como parámetro otra función.

    Por ejemplo, las derivadas e integrales son funciones que reciben
    como parámetro otra función.

    En caso de /haskell/ no vamos a derivar ni nada, pero utilizaremos
    funciones de orden superior.

    Por ejemplo, ¿qué pasa si queremos sumar uno a todos los números
    de una lista?

    #+begin_src haskell
aumenta :: [Int] -> [Int]
aumenta [] = []
aumenta (x:xs) = x+1 : aumenta xs
    #+end_src

    Y ahora, ¿si lo que queremos es elevar al cuadrado todos los
    números de una lista?

    #+begin_src haskell
eleva :: [Int] -> [Int]
eleva [] = []
eleva (x:xs) = x^2 : eleva xs
    #+end_src

    Las dos funciones son muy similares, ¿es posible generalizarlas?

    Sí, con funciones de orden superior:

    #+begin_src haskell
mimap :: (a -> b) -> [a] -> [b]
mimap f [] = []
mimap f (x:xs) = f x : mimap f xs
    #+end_src

    Entonces, ¿cómo elevamos al cuadrado todos los elementos de una lista?

    #+begin_src haskell
ghci> mimap (\x -> x ^ 2) [1,2,3,4,5]
[1,4,9,16,25]
ghci> mimap (\x -> x + 1) [1,2,3,4,5]
[2,3,4,5,6]
    #+end_src

    Ahora, qué si queremos 
    
* Lógica proposicional en Haskell
   
  #+begin_src haskell
type Name = String

data Prop = Var Name | Val Bool
          | Neg Prop
          | Prop #||# Prop
          | Prop #&&# Prop
          | Prop #-># Prop
          | Prop #<># Prop

infixl 7 #&&#, #||#
infixr 8 #->#, #<>#
  #+end_src

* Prolog

  /Prolog/ es un lenguaje de programación dentro del paradigma declarativo.

  Es un lenguaje lógico, en donde un programa es un conjunto de hechos
  y reglas, que definen relaciones, de tal forma que un cómputo se
  vuelve una consulta en éste programa.

