presentaciones/Logica7068/laboratorio.html

<div id="outline-container-org8ab349c" class="outline-4">
<h4 id="org8ab349c">Coincidencia de patrones</h4>
<div class="outline-text-4" id="text-org8ab349c">
<p>
Éste se le conoce en inglés como <i>pattern matching</i> y en español
muchas veces lo encontrarán como <i>caza de patrones</i>.
</p>

<p>
¿Cómo podemos utilizar funciones con éstos tipos de dato?
</p>

<div class="org-src-container">
<pre class="src src-haskell">describe :: Color -&gt; String
describe color = case color of
                   Rojo -&gt; "El color es rojo"
                   Verde -&gt; "El color es verde"
                   Azul -&gt; "El color es azul"
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">describe2 :: Color -&gt; String
describe2 Rojo = "El color es rojo"
describe2 Verde = "El color es verde"
describe2 Azul = "El color es azul"
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">predecesor :: Nat -&gt; Nat
predecesor Zero = Zero
predecesor (Suc n) = n
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">ceroUno :: Nat -&gt; Nat
ceroUno Zero = Suc Zero
ceroUno n = n
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">esZero :: Nat -&gt; Bool
esZero Zero = True
esZero _ = False
</pre>
</div>

<p>
¿Ahora, cómo hacemos coincidencia de patrones con listas?
</p>

<div class="org-src-container">
<pre class="src src-haskell">alMenosUno :: [a] -&gt; Bool
alMenosUno [] = False
alMenosUno _ = True
</pre>
</div>

<p>
Si queremos obtener la cabeza de una lista:
</p>

<div class="org-src-container">
<pre class="src src-haskell">cabeza :: [a] -&gt; a
cabeza (x:xs) = x
</pre>
</div>

<p>
Si queremos obtener la cola de una lista:
</p>

<div class="org-src-container">
<pre class="src src-haskell">cola :: [a] -&gt; [a]
cola (x:xs) = xs
</pre>
</div>

<p>
Suma en naturales:
</p>

<p>
\(+(0,x)=x\)
</p>

<p>
\(+(s(n), m)=s(n+m)\)
</p>

<div class="org-src-container">
<pre class="src src-haskell">sumaNats :: Nat -&gt; Nat -&gt; Nat
sumaNats Zero m = m
sumaNats (Suc n) m = Suc (sumaNats n m)
</pre>
</div>

<p>
Niveles en un árbol:
</p>

<p>
Consideremos la definición de árboles binarios que viene en su
primera práctica:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Bin a = Vacio
           | Nodo a (Bin a) (Bin a) deriving Show
</pre>
</div>

<p>
Ahora queremos una función que nos regrese el número de hojas que hay en un árbol.
</p>

<p>
Una hoja es un árbol cuyos hijos izquierdo y derecho son vacíos.
</p>

<div class="org-src-container">
<pre class="src src-haskell">hojas :: Bin a -&gt; Int
hojas Vacio = 0
hojas (Nodo a Vacio Vacio) = 1
hojas (Nodo a l r) = hojas l + hojas r
</pre>
</div>

<p>
El nivel de un árbol:
</p>

<div class="org-src-container">
<pre class="src src-haskell">nivel :: Bin a -&gt; Int
nivel Vacio = -1
nivel (Nodo a l r) = 1 + max (nivel l) (nivel r)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1443e3" class="outline-4">
<h4 id="orgb1443e3">Funciones de orden superior</h4>
<div class="outline-text-4" id="text-orgb1443e3">
<p>
Una función de orden superior, es una función que puede recibir
como parámetro otra función.
</p>

<p>
Por ejemplo, las derivadas e integrales son funciones que reciben
como parámetro otra función.
</p>

<p>
En caso de <i>haskell</i> no vamos a derivar ni nada, pero utilizaremos
funciones de orden superior.
</p>

<p>
Por ejemplo, ¿qué pasa si queremos sumar uno a todos los números
de una lista?
</p>

<div class="org-src-container">
<pre class="src src-haskell">aumenta :: [Int] -&gt; [Int]
aumenta [] = []
aumenta (x:xs) = x+1 : aumenta xs
</pre>
</div>

<p>
Y ahora, ¿si lo que queremos es elevar al cuadrado todos los
números de una lista?
</p>

<div class="org-src-container">
<pre class="src src-haskell">eleva :: [Int] -&gt; [Int]
eleva [] = []
eleva (x:xs) = x^2 : eleva xs
</pre>
</div>

<p>
Las dos funciones son muy similares, ¿es posible generalizarlas?
</p>

<p>
Sí, con funciones de orden superior:
</p>

<div class="org-src-container">
<pre class="src src-haskell">mimap :: (a -&gt; b) -&gt; [a] -&gt; [b]
mimap f [] = []
mimap f (x:xs) = f x : mimap f xs
</pre>
</div>

<p>
Entonces, ¿cómo elevamos al cuadrado todos los elementos de una lista?
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; mimap (\x -&gt; x ^ 2) [1,2,3,4,5]
[1,4,9,16,25]
ghci&gt; mimap (\x -&gt; x + 1) [1,2,3,4,5]
[2,3,4,5,6]
</pre>
</div>

<p>
Ahora, qué si queremos 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orge3eb640" class="outline-2">
<h2 id="orge3eb640">Lógica proposicional en Haskell</h2>
<div class="outline-text-2" id="text-orge3eb640">
<div class="org-src-container">
<pre class="src src-haskell">type Name = String

data Prop = Var Name | Val Bool
          | Neg Prop
          | Prop #||# Prop
          | Prop #&amp;&amp;# Prop
          | Prop #-&gt;# Prop
          | Prop #&lt;&gt;# Prop

infixl 7 #&amp;&amp;#, #||#
infixr 8 #-&gt;#, #&lt;&gt;#
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b3c920" class="outline-2">
<h2 id="org8b3c920">Prolog</h2>
<div class="outline-text-2" id="text-org8b3c920">
<p>
<i>Prolog</i> es un lenguaje de programación dentro del paradigma declarativo.
</p>

<p>
Es un lenguaje lógico, en donde un programa es un conjunto de hechos
y reglas, que definen relaciones, de tal forma que un cómputo se
vuelve una consulta en éste programa.
</p>
</div>
