content/presentaciones/Logica7068/laboratorio.org
** Predicados y constantes

   En /Prolog/ podemos definir predicados sobre constantes concretas, lo
   único que se requiere es que tanto el nombre del predicado como el
   nombre de nuestra constante comience con minúscula.

   Por ejemplo, el siguiente predicado nos dice que su parámetro es escritor.

   #+begin_src prolog
escritor(vargas_llosa). %% Mario Vargas Llosa es un escritor
escritor(carlos_fuentes). %% Carlos Fuentes es un escritor
escritor(ryu_murakami). %% Ryu Murakami es un escritor

%% Sobra decir que los comentarios en prolog se denotan con el símbolo
%% de %
   #+end_src

   
   Éstos predicados pueden tener distinta aridad para dar mejor
   descripciones.

   Por ejemplo, el siguiente predicado es =escribio(X,Y)= y nos dice que
   el autor =X= escribió =Y=.

   #+begin_src prolog
escribio(vargas_llosa, felicidad_en_la_otra_esquina).
%% Mario Vargas Llosa escribió: La felicidad en la otra esquina
escribio(vargas_llosa, los_cachorros).
%% Mario Vargas Llosa escribió: Los cachorros
escribio(carlos_fuentes, gringo_viejo).
%% Carlos Fuentes escribió: Gringo Viejo
escribio(carlos_fuentes, aura).
%% Carlos Fuentes escribió: Aura
escribio(ryu_murakami, azul_casi_transparente).
%% Ryu Murakami escribió: Azul casi transparente
escribio(erik_rangel, notas_lab).
%% Erik Rangel escribió las notas de laboratorio
   #+end_src

   Y así, podemos especificar más propiedades sobre nuestras constantes.

   #+begin_src prolog
latinoamericano(vargas_llosa). %% Mario Vargas Llosa es latinoamericano
latinoamericano(carlos_fuentes). %% Carlos Fuentes es latinoamericano
latinoamericano(erik_rangel). %% Erik Rangel es latinoamericano

reconocimiento(los_cachorros).
%% El libro "Los cachorros" tuvo reconocimiento internacional
reconocimiento(aura).
%% El libro "Aura" tuvo reconocimiento internacional
reconocimiento(azul_casi_transparente).
%% El libro "Azul casi transparente" tuvo reconocimiento internacional
   #+end_src

** Consultas

   Como mencionamos anteriormente, en prolog sólo definimos hechos y
   reglas, tal y como lo hicimos en la sección anterior.

   Toda esta información será nuestra base de conocimientos, y ésta la
   pueden guardar en un archivo con terminación =.pl=

   Podemos interpretar ésta base de conocimientos con la orden =swipl
   archivo.pl=, y nos saldrá un prompt como el siguiente:

   #+begin_src prolog
?-
   #+end_src

   Aquí podemos hacer consultas sobre cosas que definimos en nuestra
   base de conocimientos.

   #+begin_src prolog
?- escritor(carlos_fuentes).
true.
?- escritor(erik_rangel).
false.
?- escribio(ryu_murakami, azul_casi_transparente).
true.
?- escribio(ryu_murakami, aura).
true.
   #+end_src

** Condiciones y Variables

   Podemos dar propiedades más específicas usando condiciones, por
   ejemplo, si queremos expresar la propiedad:

   /Si un escritor latinoamericano escribió un libro que tuvo/
   /reconocimiento internacional, entonces pertenece al boom
   latinoamericano./

   Para expresar ésto en prolog lo podríamos hacer de la siguiente
   forma:

   #+begin_src prolog
boom_lat(X) :- escritor(X),
	       latinoamericano(X),
	       escribio(X,Y),
	       reconocimiento(Y).
   #+end_src

   Las condiciones tienen la siguiente forma:

   =<conclusión> :- <condiciones>.=

   Y también con ésto introducimos a las variables, las cuales tienen
   la única condición de que deben inciar con mayúscula.

   Ahora, con ésto prolog nos puede responder nuevas consultas:

   #+begin_src prolog
?- boom_lat(carlos_fuentes).
true.
?- boom_lat(erik_rangel).
false.
   #+end_src

   También con la introducción de variables, podemos hacer consultas
   más útiles, por ejemplo, podríamos preguntarle a prolog qué autores
   pertenecen al boom latinoamericano.

   #+begin_src prolog
?- boom_lat(X).
X = vargas_llosa
   #+end_src

   Al introducir ésta consulta, prolog nos regresa un posible valor
   para la =X= que le pasamos, sin embargo, no nos devuelve al prompt,
   ésto quiere decir que prolog puede intentar obtener otro posible
   valor para =X=.

   Si la =X= que nos dió es suficiente para nosotros, entonces podemos
   presionar =Enter= o =.= para volver al prompt.

      #+begin_src prolog
?- boom_lat(X).
X = vargas_llosa.
?-
   #+end_src

   Si queremos ver el otro resultado, en su lugar podemos presionar =;=
   hasta que ya no haya más resultados.

   #+begin_src prolog
?- boom_lat(X).
X = vargas_llosa ;
X = carlos_fuentes ;
false.
   #+end_src

