presentaciones/Logica7068/laboratorio.html

<div id="outline-container-orge4d5615" class="outline-3">
<h3 id="orge4d5615">Predicados y constantes</h3>
<div class="outline-text-3" id="text-orge4d5615">
<p>
En <i>Prolog</i> podemos definir predicados sobre constantes concretas, lo
único que se requiere es que tanto el nombre del predicado como el
nombre de nuestra constante comience con minúscula.
</p>

<p>
Por ejemplo, el siguiente predicado nos dice que su parámetro es escritor.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">escritor</span>(vargas_llosa). <span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Mario Vargas Llosa es un escritor</span>
<span style="font-weight: bold;">escritor</span>(carlos_fuentes). <span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Carlos Fuentes es un escritor</span>
<span style="font-weight: bold;">escritor</span>(ryu_murakami). <span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Ryu Murakami es un escritor</span>

<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Sobra decir que los comentarios en prolog se denotan con el s&#237;mbolo</span>
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">de %</span>
</pre>
</div>


<p>
Éstos predicados pueden tener distinta aridad para dar mejor
descripciones.
</p>

<p>
Por ejemplo, el siguiente predicado es <code>escribio(X,Y)</code> y nos dice que
el autor <code>X</code> escribió <code>Y</code>.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">escribio</span>(vargas_llosa, felicidad_en_la_otra_esquina).
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Mario Vargas Llosa escribi&#243;: La felicidad en la otra esquina</span>
<span style="font-weight: bold;">escribio</span>(vargas_llosa, los_cachorros).
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Mario Vargas Llosa escribi&#243;: Los cachorros</span>
<span style="font-weight: bold;">escribio</span>(carlos_fuentes, gringo_viejo).
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Carlos Fuentes escribi&#243;: Gringo Viejo</span>
<span style="font-weight: bold;">escribio</span>(carlos_fuentes, aura).
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Carlos Fuentes escribi&#243;: Aura</span>
<span style="font-weight: bold;">escribio</span>(ryu_murakami, azul_casi_transparente).
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Ryu Murakami escribi&#243;: Azul casi transparente</span>
<span style="font-weight: bold;">escribio</span>(erik_rangel, notas_lab).
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Erik Rangel escribi&#243; las notas de laboratorio</span>
</pre>
</div>

<p>
Y así, podemos especificar más propiedades sobre nuestras constantes.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">latinoamericano</span>(vargas_llosa). <span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Mario Vargas Llosa es latinoamericano</span>
<span style="font-weight: bold;">latinoamericano</span>(carlos_fuentes). <span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Carlos Fuentes es latinoamericano</span>
<span style="font-weight: bold;">latinoamericano</span>(erik_rangel). <span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">Erik Rangel es latinoamericano</span>

<span style="font-weight: bold;">reconocimiento</span>(los_cachorros).
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">El libro "Los cachorros" tuvo reconocimiento internacional</span>
<span style="font-weight: bold;">reconocimiento</span>(aura).
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">El libro "Aura" tuvo reconocimiento internacional</span>
<span style="font-weight: bold;">reconocimiento</span>(azul_casi_transparente).
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">El libro "Azul casi transparente" tuvo reconocimiento internacional</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org849a722" class="outline-3">
<h3 id="org849a722">Consultas</h3>
<div class="outline-text-3" id="text-org849a722">
<p>
Como mencionamos anteriormente, en prolog sólo definimos hechos y
reglas, tal y como lo hicimos en la sección anterior.
</p>

<p>
Toda esta información será nuestra base de conocimientos, y ésta la
pueden guardar en un archivo con terminación <code>.pl</code>
</p>

<p>
Podemos interpretar ésta base de conocimientos con la orden <code>swipl
   archivo.pl</code>, y nos saldrá un prompt como el siguiente:
</p>

<div class="org-src-container">
<pre class="src src-prolog">?-
</pre>
</div>

<p>
Aquí podemos hacer consultas sobre cosas que definimos en nuestra
base de conocimientos.
</p>

<div class="org-src-container">
<pre class="src src-prolog">?- escritor(carlos_fuentes).
true.
?- escritor(erik_rangel).
false.
?- escribio(ryu_murakami, azul_casi_transparente).
true.
?- escribio(ryu_murakami, aura).
true.
</pre>
</div>
</div>
</div>

<div id="outline-container-org5660c27" class="outline-3">
<h3 id="org5660c27">Condiciones y Variables</h3>
<div class="outline-text-3" id="text-org5660c27">
<p>
Podemos dar propiedades más específicas usando condiciones, por
ejemplo, si queremos expresar la propiedad:
</p>

<p>
<i>Si un escritor latinoamericano escribió un libro que tuvo</i>
<i>reconocimiento internacional, entonces pertenece al boom
latinoamericano.</i>
</p>

<p>
Para expresar ésto en prolog lo podríamos hacer de la siguiente
forma:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">boom_lat</span>(<span style="font-weight: bold; font-style: italic;">X</span>) :- escritor(<span style="font-weight: bold; font-style: italic;">X</span>),
               latinoamericano(<span style="font-weight: bold; font-style: italic;">X</span>),
               escribio(<span style="font-weight: bold; font-style: italic;">X</span>,<span style="font-weight: bold; font-style: italic;">Y</span>),
               reconocimiento(<span style="font-weight: bold; font-style: italic;">Y</span>).
</pre>
</div>

<p>
Las condiciones tienen la siguiente forma:
</p>

<p>
<code>&lt;conclusión&gt; :- &lt;condiciones&gt;.</code>
</p>

<p>
Y también con ésto introducimos a las variables, las cuales tienen
la única condición de que deben inciar con mayúscula.
</p>

<p>
Ahora, con ésto prolog nos puede responder nuevas consultas:
</p>

<div class="org-src-container">
<pre class="src src-prolog">?- boom_lat(carlos_fuentes).
true.
?- boom_lat(erik_rangel).
false.
</pre>
</div>

<p>
También con la introducción de variables, podemos hacer consultas
más útiles, por ejemplo, podríamos preguntarle a prolog qué autores
pertenecen al boom latinoamericano.
</p>

<div class="org-src-container">
<pre class="src src-prolog">?- boom_lat(<span style="font-weight: bold; font-style: italic;">X</span>).
<span style="font-weight: bold; font-style: italic;">X</span> = vargas_llosa
</pre>
</div>

<p>
Al introducir ésta consulta, prolog nos regresa un posible valor
para la <code>X</code> que le pasamos, sin embargo, no nos devuelve al prompt,
ésto quiere decir que prolog puede intentar obtener otro posible
valor para <code>X</code>.
</p>

<p>
Si la <code>X</code> que nos dió es suficiente para nosotros, entonces podemos
presionar <code>Enter</code> o <code>.</code> para volver al prompt.
</p>

<div class="org-src-container">
<pre class="src src-prolog">?- boom_lat(<span style="font-weight: bold; font-style: italic;">X</span>).
<span style="font-weight: bold; font-style: italic;">X</span> = vargas_llosa.
?-
</pre>
</div>

<p>
Si queremos ver el otro resultado, en su lugar podemos presionar <code>;</code>
hasta que ya no haya más resultados.
</p>

<div class="org-src-container">
<pre class="src src-prolog">?- boom_lat(<span style="font-weight: bold; font-style: italic;">X</span>).
<span style="font-weight: bold; font-style: italic;">X</span> = vargas_llosa <span style="font-weight: bold;">;</span>
<span style="font-weight: bold; font-style: italic;">X</span> = carlos_fuentes <span style="font-weight: bold;">;</span>
false.
</pre>
</div>
</div>
</div>
