content/presentaciones/Logica7068/laboratorio.org
** Backtracking

   ¿Por qué al final de la última consulta nos sale =false=?

   Ésto es por la forma en la que prolog hace sus consultas, que es
   por medio de /backtracking/. Esta forma de realizar operaciones
   permite a prolog explorar todas las posibilidades hasta encontrar
   un resultado, de tal forma que al encontrar un resultado que no es
   válido (o necesitar otro posible resultado), prolog pueda regresar
   en las decisiones que tomó y elegir otra posibilidad

   /Prolog/ permite ver cómo se realiza cada una de estas decisiones al
   escribir el predicado =trace=.

   #+begin_src prolog
?- trace.
true.

[trace]  ?-
   #+end_src

   Vemos como cambia el prompt para recordar que la opción =trace= está
   activada.

   Y ahora si hacemos una consulta como lo hacíamos antes, nos va a
   mostrar los pasos intermedios que se hacen antes de devolver un
   resultado.

   #+begin_src prolog
[trace]  ?- boom_lat(X).
   Call: (12) boom_lat(_5940) ? creep
   Call: (13) escritor(_5940) ? creep
   Exit: (13) escritor(vargas_llosa) ? creep
   Call: (13) latinoamericano(vargas_llosa) ? creep
   Exit: (13) latinoamericano(vargas_llosa) ? creep
   Call: (13) escribio(vargas_llosa, _10454) ? creep
   Exit: (13) escribio(vargas_llosa, felicidad_en_la_otra_esquina) ? creep
   Call: (13) reconocimiento(felicidad_en_la_otra_esquina) ? creep
   Fail: (13) reconocimiento(felicidad_en_la_otra_esquina) ? creep
   Redo: (13) escribio(vargas_llosa, _10454) ? creep
   Exit: (13) escribio(vargas_llosa, los_cachorros) ? creep
   Call: (13) reconocimiento(los_cachorros) ? creep
   Exit: (13) reconocimiento(los_cachorros) ? creep
   Exit: (12) boom_lat(vargas_llosa) ? creep
X = vargas_llosa ;
   Redo: (13) escritor(_5940) ? creep
   Exit: (13) escritor(carlos_fuentes) ? creep
   Call: (13) latinoamericano(carlos_fuentes) ? creep
   Exit: (13) latinoamericano(carlos_fuentes) ? creep
   Call: (13) escribio(carlos_fuentes, _22466) ? creep
   Exit: (13) escribio(carlos_fuentes, gringo_viejo) ? creep
   Call: (13) reconocimiento(gringo_viejo) ? creep
   Fail: (13) reconocimiento(gringo_viejo) ? creep
   Redo: (13) escribio(carlos_fuentes, _22466) ? creep
   Exit: (13) escribio(carlos_fuentes, aura) ? creep
   Call: (13) reconocimiento(aura) ? creep
   Exit: (13) reconocimiento(aura) ? creep
   Exit: (12) boom_lat(carlos_fuentes) ? creep
X = carlos_fuentes ;
   Redo: (13) escritor(_5940) ? creep
   Exit: (13) escritor(ryu_murakami) ? creep
   Call: (13) latinoamericano(ryu_murakami) ? creep
   Fail: (13) latinoamericano(ryu_murakami) ? creep
   Fail: (12) boom_lat(_5940) ? creep
false.
   #+end_src

** Números y Operadores

   Como comúnmente tenemos en los lenguajes de programación, los operadores aritméticos son:

   #+begin_src prolog
suma(X, Y, X + Y).
resta(X, Y, X - Y).
multiplicacion(X, Y, X * Y).
division(X, Y, X / Y).
   #+end_src

   Los operadores de comparación:

   #+begin_src prolog
igualdad(X, Y) :- X =:= Y.
desigualdad(X, Y) :- X =\= Y.
menor_que(X, Y) :- X < Y.
mayor_que(X, Y) :- X > Y.
menor_igual(X, Y) :- X =< Y.
mayor_igual(X, Y) :- X >= Y.
   #+end_src
   
*** Negación como falla

    En /Prolog/ toda proposición que no haya sido escrita en la base de
    conocimientos (o no pueda ser determinada) será considerada como
    =false=, pero cabe decir que este resultado no es definitivo, sólo
    nos dice que no se encontró una forma de demostrarlo.

    Por ejemplo, nostros no le dijimos a /Prolog/ que /Shakespeare/ fue un
    escritor, por lo que tendremos como resultado de una consulta así
    lo siguiente:

    #+begin_src prolog
?- escritor(shakespeare).
false.
?-
    #+end_src

    Nos dirá que esto es falso a pesar de que nosotros sepamos que
    /Shakespeare/ sí fue un escritor.

    Por ello no existe como tal un operación de negación en prolog,
    pero sí tendremos un operador para ver si algo /no es demostrable/.

    #+begin_src prolog
no_escritor(X) :- \+ escritor(X).
    #+end_src

