presentaciones/Logica7068/laboratorio.html

<div id="outline-container-orgd95c9c6" class="outline-3">
<h3 id="orgd95c9c6">Backtracking</h3>
<div class="outline-text-3" id="text-orgd95c9c6">
<p>
¿Por qué al final de la última consulta nos sale <code>false</code>?
</p>

<p>
Ésto es por la forma en la que prolog hace sus consultas, que es
por medio de <i>backtracking</i>. Esta forma de realizar operaciones
permite a prolog explorar todas las posibilidades hasta encontrar
un resultado, de tal forma que al encontrar un resultado que no es
válido (o necesitar otro posible resultado), prolog pueda regresar
en las decisiones que tomó y elegir otra posibilidad
</p>

<p>
<i>Prolog</i> permite ver cómo se realiza cada una de estas decisiones al
escribir el predicado <code>trace</code>.
</p>

<div class="org-src-container">
<pre class="src src-prolog">?- trace.
true.

<span style="font-weight: bold;">[</span>trace<span style="font-weight: bold;">]</span>  ?-
</pre>
</div>

<p>
Vemos como cambia el prompt para recordar que la opción <code>trace</code> está
activada.
</p>

<p>
Y ahora si hacemos una consulta como lo hacíamos antes, nos va a
mostrar los pasos intermedios que se hacen antes de devolver un
resultado.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">[</span>trace<span style="font-weight: bold;">]</span>  ?- boom_lat(<span style="font-weight: bold; font-style: italic;">X</span>).
   <span style="font-weight: bold; font-style: italic;">Call</span>: (12) boom_lat(<span style="font-weight: bold; font-style: italic;">_5940</span>) ? creep
   <span style="font-weight: bold; font-style: italic;">Call</span>: (13) escritor(<span style="font-weight: bold; font-style: italic;">_5940</span>) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) escritor(vargas_llosa) ? creep
   <span style="font-weight: bold; font-style: italic;">Call</span>: (13) latinoamericano(vargas_llosa) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) latinoamericano(vargas_llosa) ? creep
   <span style="font-weight: bold; font-style: italic;">Call</span>: (13) escribio(vargas_llosa, <span style="font-weight: bold; font-style: italic;">_10454</span>) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) escribio(vargas_llosa, felicidad_en_la_otra_esquina) ? creep
   <span style="font-weight: bold; font-style: italic;">Call</span>: (13) reconocimiento(felicidad_en_la_otra_esquina) ? creep
   <span style="font-weight: bold; font-style: italic;">Fail</span>: (13) reconocimiento(felicidad_en_la_otra_esquina) ? creep
   <span style="font-weight: bold; font-style: italic;">Redo</span>: (13) escribio(vargas_llosa, <span style="font-weight: bold; font-style: italic;">_10454</span>) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) escribio(vargas_llosa, los_cachorros) ? creep
   <span style="font-weight: bold; font-style: italic;">Call</span>: (13) reconocimiento(los_cachorros) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) reconocimiento(los_cachorros) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (12) boom_lat(vargas_llosa) ? creep
<span style="font-weight: bold; font-style: italic;">X</span> = vargas_llosa <span style="font-weight: bold;">;</span>
   <span style="font-weight: bold; font-style: italic;">Redo</span>: (13) escritor(<span style="font-weight: bold; font-style: italic;">_5940</span>) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) escritor(carlos_fuentes) ? creep
   <span style="font-weight: bold; font-style: italic;">Call</span>: (13) latinoamericano(carlos_fuentes) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) latinoamericano(carlos_fuentes) ? creep
   <span style="font-weight: bold; font-style: italic;">Call</span>: (13) escribio(carlos_fuentes, <span style="font-weight: bold; font-style: italic;">_22466</span>) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) escribio(carlos_fuentes, gringo_viejo) ? creep
   <span style="font-weight: bold; font-style: italic;">Call</span>: (13) reconocimiento(gringo_viejo) ? creep
   <span style="font-weight: bold; font-style: italic;">Fail</span>: (13) reconocimiento(gringo_viejo) ? creep
   <span style="font-weight: bold; font-style: italic;">Redo</span>: (13) escribio(carlos_fuentes, <span style="font-weight: bold; font-style: italic;">_22466</span>) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) escribio(carlos_fuentes, aura) ? creep
   <span style="font-weight: bold; font-style: italic;">Call</span>: (13) reconocimiento(aura) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) reconocimiento(aura) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (12) boom_lat(carlos_fuentes) ? creep
<span style="font-weight: bold; font-style: italic;">X</span> = carlos_fuentes <span style="font-weight: bold;">;</span>
   <span style="font-weight: bold; font-style: italic;">Redo</span>: (13) escritor(<span style="font-weight: bold; font-style: italic;">_5940</span>) ? creep
   <span style="font-weight: bold; font-style: italic;">Exit</span>: (13) escritor(ryu_murakami) ? creep
   <span style="font-weight: bold; font-style: italic;">Call</span>: (13) latinoamericano(ryu_murakami) ? creep
   <span style="font-weight: bold; font-style: italic;">Fail</span>: (13) latinoamericano(ryu_murakami) ? creep
   <span style="font-weight: bold; font-style: italic;">Fail</span>: (12) boom_lat(<span style="font-weight: bold; font-style: italic;">_5940</span>) ? creep
false.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf716277" class="outline-3">
<h3 id="orgf716277">Números y Operadores</h3>
<div class="outline-text-3" id="text-orgf716277">
<p>
Como comúnmente tenemos en los lenguajes de programación, los operadores aritméticos son:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">suma</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>, <span style="font-weight: bold; font-style: italic;">X</span> + <span style="font-weight: bold; font-style: italic;">Y</span>).
<span style="font-weight: bold;">resta</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>, <span style="font-weight: bold; font-style: italic;">X</span> - <span style="font-weight: bold; font-style: italic;">Y</span>).
<span style="font-weight: bold;">multiplicacion</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>, <span style="font-weight: bold; font-style: italic;">X</span> * <span style="font-weight: bold; font-style: italic;">Y</span>).
<span style="font-weight: bold;">division</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>, <span style="font-weight: bold; font-style: italic;">X</span> / <span style="font-weight: bold; font-style: italic;">Y</span>).
</pre>
</div>

<p>
Los operadores de comparación:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">igualdad</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>) :- <span style="font-weight: bold; font-style: italic;">X</span> =:= <span style="font-weight: bold; font-style: italic;">Y</span>.
<span style="font-weight: bold;">desigualdad</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>) :- <span style="font-weight: bold; font-style: italic;">X</span> =\= <span style="font-weight: bold; font-style: italic;">Y</span>.
<span style="font-weight: bold;">menor_que</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>) :- <span style="font-weight: bold; font-style: italic;">X</span> &lt; <span style="font-weight: bold; font-style: italic;">Y</span>.
<span style="font-weight: bold;">mayor_que</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>) :- <span style="font-weight: bold; font-style: italic;">X</span> &gt; <span style="font-weight: bold; font-style: italic;">Y</span>.
<span style="font-weight: bold;">menor_igual</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>) :- <span style="font-weight: bold; font-style: italic;">X</span> =&lt; <span style="font-weight: bold; font-style: italic;">Y</span>.
<span style="font-weight: bold;">mayor_igual</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>) :- <span style="font-weight: bold; font-style: italic;">X</span> &gt;= <span style="font-weight: bold; font-style: italic;">Y</span>.
</pre>
</div>
</div>

<div id="outline-container-orgbc3920e" class="outline-4">
<h4 id="orgbc3920e">Negación como falla</h4>
<div class="outline-text-4" id="text-orgbc3920e">
<p>
En <i>Prolog</i> toda proposición que no haya sido escrita en la base de
conocimientos (o no pueda ser determinada) será considerada como
<code>false</code>, pero cabe decir que este resultado no es definitivo, sólo
nos dice que no se encontró una forma de demostrarlo.
</p>

<p>
Por ejemplo, nostros no le dijimos a <i>Prolog</i> que <i>Shakespeare</i> fue un
escritor, por lo que tendremos como resultado de una consulta así
lo siguiente:
</p>

<div class="org-src-container">
<pre class="src src-prolog">?- escritor(shakespeare).
false.
?-
</pre>
</div>

<p>
Nos dirá que esto es falso a pesar de que nosotros sepamos que
<i>Shakespeare</i> sí fue un escritor.
</p>

<p>
Por ello no existe como tal un operación de negación en prolog,
pero sí tendremos un operador para ver si algo <i>no es demostrable</i>.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">no_escritor</span>(<span style="font-weight: bold; font-style: italic;">X</span>) :- \+ escritor(<span style="font-weight: bold; font-style: italic;">X</span>).
</pre>
</div>
</div>
</div>
