content/presentaciones/Logica7068/laboratorio.org
*** Unificación

    En prolog tenemos dos operadores distintos para verificar que dos
    expresiones son unificables:

    #+begin_src prolog
suma2(X, Y, RES) :- RES = X + Y.
suma3(X, Y, RES) :- RES is X + Y.
    #+end_src

    La primera de ellas, sólo podrá decir si =RES= en efecto unifica con
    la expresión =X+Y=, y de hecho esta unificación es la que se hacía
    cuando explicamos los operadores; mientras que la segundo podrá
    decir cuando =RES= sea unificable con el resultado de la expresión
    =X+Y=.

** Ejemplos

   Calcular la suma de todos los números naturales menores a un $n$:

   #+begin_src prolog
suma_gauss(0, 0).
suma_gauss(N, RES) :- N >= 0,
		      N1 is N - 1,
		      suma_gauss(N1, R1),
		      RES is N + R1.
   #+end_src

   Y le podemos preguntar a =prolog= el resultado

   #+begin_src prolog
?- suma_gauss(5,X).
X = 15 ;
false.
   #+end_src

   Como vemos, =prolog= piensa que puede haber otro resultado, sin
   embargo al nosotros tener el valor de la variable =RES= es porque ya
   sabemos el resultado final, y no necesitamos más resultados.

   Para este tipo de operaciones es necesario indicarle a =prolog= que
   no existen más resultados, y para ello podemos utilizar el operador
   de corte después de que se sepa que ya hay un resultado.

   #+begin_src prolog
suma_gauss(0, 0) :- !.
suma_gauss(N, RES) :- N >= 0,
		      N1 is N - 1,
		      suma_gauss(N1, R1),
		      RES is N + R1,
		      !.
   #+end_src

   #+begin_src prolog
?- suma_gauss(5,X).
X = 15.
   #+end_src

   Ahora, podemos hacer un predicado que calcula el factorial de un número.

   #+begin_src prolog
factorial(0,1) :- !.
factorial(N, RES) :- N >= 0,
		     N1 is N - 1,
		     factorial(N1, R1),
		     RES is N * R1,
		     !.
   #+end_src

   #+begin_src prolog
?- factorial(5,X).
X = 120.
   #+end_src

   Un predicado que nos da el n-ésimo número fibonacci.

   #+begin_src prolog
fibonacci(0,0) :- !.
fibonacci(1,1) :- !.
fibonacci(N, RES) :- N > 1,
		     N1 is N - 1,
		     N2 is N - 2,
		     fibonacci(N1, R1),
		     fibonacci(N2, R2),
		     RES is R1 + R2,
		     !.
   #+end_src

** Listas y comodines

   Las listas se definen inductivamente bajo la definición recursiva convencional:

   Podemos tener la lista vacía, y ésta se representa como =[]=

   Podemos tener una lista con cabeza =X= y cola =XS=, y se representa
   como =[X|XS]=.

   También podemos construir listas con al menos un primer y segundo
   elemento; éste se escribe como =[X,Y|XS]=, y así para cualquier
   cantidad de elementos.

   Por ejemplo, haremos un predicado que nos calcula la longitud de una
   lista:

   #+begin_src prolog
longitud([],0).
longitud([_|XS],RES) :- longitud(XS, N),
			RES is N + 1.
   #+end_src

   En este caso nótese que no es necesario utilizar el operador de
   corte, pues una lista sólo va a unificar con sólamente uno de los
   dos casos que definimos, o la lista vacía, o la lista con al menos
   un elemento, por lo que no va a intentar más caminos después de
   devolver el primer resultado.

   Ahora, un predicado que nos da la concatenación de dos listas:

   #+begin_src haskell
concatena([],YS,YS).
concatena([X|XS],YS,[X|R1]) :- concatena(XS,YS,R1).
   #+end_src

   Un predicado que nos da la reversa:

   #+begin_src prolog
reversa([],[]).
reversa([X|XS],RES) :- reversa(XS,R1),
		       concatena(R1,[X],RES).
   #+end_src

   Un predicado que da la suma de una lista de números:

   #+begin_src prolog
suma([],0).
suma([X|XS],RES) :- suma(XS, R1),
		    RES is R1 + X.
   #+end_src
