presentaciones/Logica7068/laboratorio.html

<div id="outline-container-org4e5da61" class="outline-4">
<h4 id="org4e5da61">Unificación</h4>
<div class="outline-text-4" id="text-org4e5da61">
<p>
En prolog tenemos dos operadores distintos para verificar que dos
expresiones son unificables:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">suma2</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>, <span style="font-weight: bold; font-style: italic;">RES</span>) :- <span style="font-weight: bold; font-style: italic;">RES</span> = <span style="font-weight: bold; font-style: italic;">X</span> + <span style="font-weight: bold; font-style: italic;">Y</span>.
<span style="font-weight: bold;">suma3</span>(<span style="font-weight: bold; font-style: italic;">X</span>, <span style="font-weight: bold; font-style: italic;">Y</span>, <span style="font-weight: bold; font-style: italic;">RES</span>) :- <span style="font-weight: bold; font-style: italic;">RES</span> is <span style="font-weight: bold; font-style: italic;">X</span> + <span style="font-weight: bold; font-style: italic;">Y</span>.
</pre>
</div>

<p>
La primera de ellas, sólo podrá decir si <code>RES</code> en efecto unifica con
la expresión <code>X+Y</code>, y de hecho esta unificación es la que se hacía
cuando explicamos los operadores; mientras que la segundo podrá
decir cuando <code>RES</code> sea unificable con el resultado de la expresión
<code>X+Y</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org559a450" class="outline-3">
<h3 id="org559a450">Ejemplos</h3>
<div class="outline-text-3" id="text-org559a450">
<p>
Calcular la suma de todos los números naturales menores a un \(n\):
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">suma_gauss</span>(0, 0).
<span style="font-weight: bold;">suma_gauss</span>(<span style="font-weight: bold; font-style: italic;">N</span>, <span style="font-weight: bold; font-style: italic;">RES</span>) :- <span style="font-weight: bold; font-style: italic;">N</span> &gt;= 0,
                      <span style="font-weight: bold; font-style: italic;">N1</span> is <span style="font-weight: bold; font-style: italic;">N</span> - 1,
                      suma_gauss(<span style="font-weight: bold; font-style: italic;">N1</span>, <span style="font-weight: bold; font-style: italic;">R1</span>),
                      <span style="font-weight: bold; font-style: italic;">RES</span> is <span style="font-weight: bold; font-style: italic;">N</span> + <span style="font-weight: bold; font-style: italic;">R1</span>.
</pre>
</div>

<p>
Y le podemos preguntar a <code>prolog</code> el resultado
</p>

<div class="org-src-container">
<pre class="src src-prolog">?- suma_gauss(5,<span style="font-weight: bold; font-style: italic;">X</span>).
<span style="font-weight: bold; font-style: italic;">X</span> = 15 <span style="font-weight: bold;">;</span>
false.
</pre>
</div>

<p>
Como vemos, <code>prolog</code> piensa que puede haber otro resultado, sin
embargo al nosotros tener el valor de la variable <code>RES</code> es porque ya
sabemos el resultado final, y no necesitamos más resultados.
</p>

<p>
Para este tipo de operaciones es necesario indicarle a <code>prolog</code> que
no existen más resultados, y para ello podemos utilizar el operador
de corte después de que se sepa que ya hay un resultado.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">suma_gauss</span>(0, 0) :- <span style="font-weight: bold;">!</span>.
<span style="font-weight: bold;">suma_gauss</span>(<span style="font-weight: bold; font-style: italic;">N</span>, <span style="font-weight: bold; font-style: italic;">RES</span>) :- <span style="font-weight: bold; font-style: italic;">N</span> &gt;= 0,
                      <span style="font-weight: bold; font-style: italic;">N1</span> is <span style="font-weight: bold; font-style: italic;">N</span> - 1,
                      suma_gauss(<span style="font-weight: bold; font-style: italic;">N1</span>, <span style="font-weight: bold; font-style: italic;">R1</span>),
                      <span style="font-weight: bold; font-style: italic;">RES</span> is <span style="font-weight: bold; font-style: italic;">N</span> + <span style="font-weight: bold; font-style: italic;">R1</span>,
                      <span style="font-weight: bold;">!</span>.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-prolog">?- suma_gauss(5,<span style="font-weight: bold; font-style: italic;">X</span>).
<span style="font-weight: bold; font-style: italic;">X</span> = 15.
</pre>
</div>

<p>
Ahora, podemos hacer un predicado que calcula el factorial de un número.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">factorial</span>(0,1) :- <span style="font-weight: bold;">!</span>.
<span style="font-weight: bold;">factorial</span>(<span style="font-weight: bold; font-style: italic;">N</span>, <span style="font-weight: bold; font-style: italic;">RES</span>) :- <span style="font-weight: bold; font-style: italic;">N</span> &gt;= 0,
                     <span style="font-weight: bold; font-style: italic;">N1</span> is <span style="font-weight: bold; font-style: italic;">N</span> - 1,
                     factorial(<span style="font-weight: bold; font-style: italic;">N1</span>, <span style="font-weight: bold; font-style: italic;">R1</span>),
                     <span style="font-weight: bold; font-style: italic;">RES</span> is <span style="font-weight: bold; font-style: italic;">N</span> * <span style="font-weight: bold; font-style: italic;">R1</span>,
                     <span style="font-weight: bold;">!</span>.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-prolog">?- factorial(5,<span style="font-weight: bold; font-style: italic;">X</span>).
<span style="font-weight: bold; font-style: italic;">X</span> = 120.
</pre>
</div>

<p>
Un predicado que nos da el n-ésimo número fibonacci.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">fibonacci</span>(0,0) :- <span style="font-weight: bold;">!</span>.
<span style="font-weight: bold;">fibonacci</span>(1,1) :- <span style="font-weight: bold;">!</span>.
<span style="font-weight: bold;">fibonacci</span>(<span style="font-weight: bold; font-style: italic;">N</span>, <span style="font-weight: bold; font-style: italic;">RES</span>) :- <span style="font-weight: bold; font-style: italic;">N</span> &gt; 1,
                     <span style="font-weight: bold; font-style: italic;">N1</span> is <span style="font-weight: bold; font-style: italic;">N</span> - 1,
                     <span style="font-weight: bold; font-style: italic;">N2</span> is <span style="font-weight: bold; font-style: italic;">N</span> - 2,
                     fibonacci(<span style="font-weight: bold; font-style: italic;">N1</span>, <span style="font-weight: bold; font-style: italic;">R1</span>),
                     fibonacci(<span style="font-weight: bold; font-style: italic;">N2</span>, <span style="font-weight: bold; font-style: italic;">R2</span>),
                     <span style="font-weight: bold; font-style: italic;">RES</span> is <span style="font-weight: bold; font-style: italic;">R1</span> + <span style="font-weight: bold; font-style: italic;">R2</span>,
                     <span style="font-weight: bold;">!</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f183d2" class="outline-3">
<h3 id="org5f183d2">Listas y comodines</h3>
<div class="outline-text-3" id="text-org5f183d2">
<p>
Las listas se definen inductivamente bajo la definición recursiva convencional:
</p>

<p>
Podemos tener la lista vacía, y ésta se representa como <code>[]</code>
</p>

<p>
Podemos tener una lista con cabeza <code>X</code> y cola <code>XS</code>, y se representa
como <code>[X|XS]</code>.
</p>

<p>
También podemos construir listas con al menos un primer y segundo
elemento; éste se escribe como <code>[X,Y|XS]</code>, y así para cualquier
cantidad de elementos.
</p>

<p>
Por ejemplo, haremos un predicado que nos calcula la longitud de una
lista:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">longitud</span>(<span style="font-weight: bold;">[]</span>,0).
<span style="font-weight: bold;">longitud</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">_</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">XS</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">RES</span>) :- longitud(<span style="font-weight: bold; font-style: italic;">XS</span>, <span style="font-weight: bold; font-style: italic;">N</span>),
                        <span style="font-weight: bold; font-style: italic;">RES</span> is <span style="font-weight: bold; font-style: italic;">N</span> + 1.
</pre>
</div>

<p>
En este caso nótese que no es necesario utilizar el operador de
corte, pues una lista sólo va a unificar con sólamente uno de los
dos casos que definimos, o la lista vacía, o la lista con al menos
un elemento, por lo que no va a intentar más caminos después de
devolver el primer resultado.
</p>

<p>
Ahora, un predicado que nos da la concatenación de dos listas:
</p>

<div class="org-src-container">
<pre class="src src-haskell">concatena([],YS,YS).
concatena([X|XS],YS,[X|R1]) :- concatena(XS,YS,R1).
</pre>
</div>

<p>
Un predicado que nos da la reversa:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">reversa</span>(<span style="font-weight: bold;">[]</span>,<span style="font-weight: bold;">[]</span>).
<span style="font-weight: bold;">reversa</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">XS</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">RES</span>) :- reversa(<span style="font-weight: bold; font-style: italic;">XS</span>,<span style="font-weight: bold; font-style: italic;">R1</span>),
                       concatena(<span style="font-weight: bold; font-style: italic;">R1</span>,<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">RES</span>).
</pre>
</div>

<p>
Un predicado que da la suma de una lista de números:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">suma</span>(<span style="font-weight: bold;">[]</span>,0).
<span style="font-weight: bold;">suma</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">XS</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">RES</span>) :- suma(<span style="font-weight: bold; font-style: italic;">XS</span>, <span style="font-weight: bold; font-style: italic;">R1</span>),
                    <span style="font-weight: bold; font-style: italic;">RES</span> is <span style="font-weight: bold; font-style: italic;">R1</span> + <span style="font-weight: bold; font-style: italic;">X</span>.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Erik Rangel Limón</p>
<p class="date">Created: 2024-08-13 Tue 14:32</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
